// utils/getMask.js
export const getMask = (phoneCode) => {
  const masks = {
    "+1": "999-999-9999", // ABD, Kanada
    "+20": "999 999 9999", // Mısır
    "+30": "99 9999 9999", // Yunanistan
    "+31": "999 999 9999", // Hollanda
    "+32": "999 999 99", // Belçika
    "+33": "9 99 99 99 99", // Fransa
    "+34": "999 999 999", // İspanya
    "+36": "99 9999 9999", // Macaristan
    "+39": "999 999 9999", // İtalya
    "+40": "999 999 999", // Romanya
    "+41": "999 999 999", // İsviçre
    "+43": "999 999 999", // Avusturya
    "+44": "99999 999999", // Birleşik Krallık
    "+45": "99 99 99 99", // Danimarka
    "+46": "999 999 999", // İsveç
    "+47": "999 99 999", // Norveç
    "+48": "999 999 999", // Polonya
    "+49": "999 9999999", // Almanya
    "+51": "999 999 999", // Peru
    "+52": "999 999 9999", // Meksika
    "+53": "99 999 999", // Küba
    "+54": "999 999 9999", // Arjantin
    "+55": "99 9999-9999", // Brezilya
    "+56": "99 999 9999", // Şili
    "+57": "999 999 9999", // Kolombiya
    "+58": "999 999 999", // Venezuela
    "+60": "999 999 999", // Malezya
    "+61": "999 999 999", // Avustralya
    "+62": "999 9999 9999", // Endonezya
    "+63": "999 999 9999", // Filipinler
    "+64": "999 999 999", // Yeni Zelanda
    "+65": "9999 9999", // Singapur
    "+66": "999 999 999", // Tayland
    "+81": "999 9999 9999", // Japonya
    "+82": "999 9999 9999", // Güney Kore
    "+84": "999 999 999", // Vietnam
    "+86": "999 9999 9999", // Çin
    "+90": "999 999 99 99", // Türkiye
    "+91": "999 999 9999", // Hindistan
    "+92": "999 999 9999", // Pakistan
    "+93": "999 999 999", // Afganistan
    "+94": "99 999 999", // Sri Lanka
    "+95": "99 999 999", // Myanmar
    "+98": "999 9999 9999", // İran
    "+211": "999 999 999", // Güney Sudan
    "+212": "99 999 9999", // Fas
    "+213": "9 99 99 99 99", // Cezayir
    "+216": "99 999 999", // Tunus
    "+218": "999 999 999", // Libya
    "+220": "999 9999", // Gambia
    "+221": "99 99 99 99", // Senegal
    "+222": "99 99 99", // Mauritanya
    "+223": "999 9999", // Mali
    "+224": "99 99 99 99", // Gine
    "+225": "99 99 99 99", // Fildişi Sahili
    "+226": "99 99 99 99", // Burkina Faso
    "+227": "99 99 99 99", // Nijer
    "+228": "99 99 99 99", // Togo
    "+229": "99 99 99 99", // Benin
    "+230": "999 9999", // Mauritius
    "+231": "999 9999", // Liberya
    "+232": "99 999999", // Sierra Leone
    "+233": "999 999 999", // Gana
    "+234": "999 999 9999", // Nijerya
    "+235": "99 99 99", // Çad
    "+236": "99 99 99 99", // Orta Afrika Cumhuriyeti
    "+237": "999 999 999", // Kamerun
    "+238": "999 9999", // Cape Verde
    "+239": "999 9999", // São Tomé ve Príncipe
    "+240": "999 999 999", // Ekvator Ginesi
    "+241": "99 99 99", // Gabon
    "+242": "99 999 9999", // Kongo
    "+243": "999 999 999", // Kongo Demokratik Cumhuriyeti
    "+244": "999 999 999", // Angola
    "+245": "99 99 99 99", // Gine-Bissau
    "+246": "999 9999", // Diego Garcia (İngiltere)
    "+247": "999 999", // Ascension Adası
    "+248": "999 9999", // Seyşeller
    "+249": "999 999", // Sudan
    "+250": "999 999 999", // Ruanda
    "+251": "99 999 9999", // Etiyopya
    "+252": "99 99 99 99", // Somali
    "+253": "99 99 99 99", // Cibuti
    "+254": "999 999 999", // Kenya
    "+255": "999 999 999", // Tanzanya
    "+256": "999 999 999", // Uganda
    "+257": "99 99 99 99", // Burundi
    "+258": "999 999 999", // Mozambik
    "+260": "999 999 999", // Zambiya
    "+261": "99 999 999", // Madagaskar
    "+262": "999 999 999", // Reunion (Fransa)
    "+263": "999 999 999", // Zimbabve
    "+264": "99 999 999", // Namibya
    "+265": "999 9999", // Malavi
    "+266": "999 9999", // Lesotho
    "+267": "999 9999", // Botsvana
    "+268": "999 9999", // Esvatini
    "+269": "999 9999", // Komor Adaları
    "+290": "9999", // Saint Helena
    "+291": "999 999", // Eritre
    "+292": "999 999", // Ekvator Ginesi
    "+297": "999 9999", // Aruba
    "+298": "999 999", // Faroe Adaları
    "+299": "999 999", // Grönland
    "+350": "999 99999", // Cebelitarık
    "+351": "999 999 999", // Portekiz
    "+352": "999 999 999", // Lüksemburg
    "+353": "999 9999", // İrlanda
    "+354": "999 9999", // İzlanda
    "+355": "999 999 999", // Arnavutluk
    "+356": "999 999", // Malta
    "+357": "999 9999", // Kıbrıs
    "+358": "999 999 999", // Finlandiya
    "+359": "999 999 999", // Bulgaristan
    "+370": "999 99999", // Litvanya
    "+371": "99 999 999", // Letonya
    "+372": "999 9999", // Estonya
    "+373": "999 999", // Moldova
    "+374": "99 999 99", // Ermenistan
    "+375": "99 999 99 99", // Belarus
    "+376": "999 999", // Andorra
    "+377": "999 9999", // Monako
    "+378": "999 999 999", // San Marino
    "+379": "999 999 999", // Vatikan
    "+380": "999 999 999", // Ukrayna
    "+381": "99 999 999", // Sırbistan
    "+382": "999 999", // Karadağ
    "+383": "999 999", // Kosova
    "+384": "99 999 99", // Bosna-Hersek
    "+385": "99 999 999", // Hırvatistan
    "+386": "999 9999", // Slovenya
    "+387": "99 999 999", // Bosna-Hersek
    "+388": "99 999 999", // Avusturya
    "+389": "99 999 999", // Kuzey Makedonya
    "+420": "999 999 999", // Çek Cumhuriyeti
    "+421": "999 999 999", // Slovakya
    "+422": "999 999 999", // Ukrayna
    "+423": "999 999", // Lihtenştayn
    "+500": "99999", // Falkland Adaları
    "+501": "999 9999", // Belize
    "+502": "9999 9999", // Gine
    "+503": "9999 9999", // El Salvador
    "+504": "9999 9999", // Honduras
    "+505": "999 9999", // Nikaragua
    "+506": "9999 9999", // Kosta Rika
    "+507": "9999 9999", // Panama
    "+508": "99 99 99", // Saint Pierre ve Miquelon
    "+509": "999 9999", // Haiti
    "+590": "999 9999", // Guadeloupe
    "+591": "999 9999", // Bolivya
    "+592": "999 9999", // Guyana
    "+593": "999 9999", // Ekvador
    "+594": "999 9999", // Fransız Guyanası
    "+595": "999 9999", // Paraguay
    "+596": "999 9999", // Martinik
    "+597": "999 9999", // Surinam
    "+598": "999 999 999", // Uruguay
    "+599": "999 9999", // Karayipler
    "+670": "999 9999", // Timor-Leste
    "+672": "999 999", // Avustralya (Kuzey Bölgesi)
    "+673": "999 9999", // Brunei
    "+674": "999 999", // Nauru
    "+675": "999 9999", // Papua Yeni Gine
    "+676": "999 999", // Tonga
    "+677": "999 9999", // Solomon Adaları
    "+678": "999 9999", // Vanuatu
    "+679": "999 9999", // Fiji
    "+680": "999 9999", // Palau
    "+681": "999 999", // Wallis ve Futuna
    "+682": "999 999", // Cook Adaları
    "+683": "999", // Niue
    "+685": "9999", // Samoa
    "+686": "99 999", // Kiribati
    "+687": "99 99", // Yeni Kaledonya
    "+688": "99 9999", // Tuvalu
    "+689": "99 99", // Fransız Polinezyası
    "+690": "99 999", // Tokelau
    "+691": "999 9999", // Mikronezya
    "+692": "999 9999", // Marsh Adaları
    "+993": "99 999 99", // Türkmenistan
    "+994": "999 999 999", // Azerbaycan
    "+995": "999 999 999", // Gürcistan
    "+996": "999 999 999", // Kırgızistan
    "+997": "99 999 9999", // Kazakistan
    "+998": "999 999 9999", // Özbekistan
  };

  return masks[phoneCode] || "9999999999"; // Default mask
};
